# Project 3

## Part 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
basics_url="https://datasets.imdbws.com/title.basics.tsv.gz"

In [3]:
akas_url="https://datasets.imdbws.com/title.akas.tsv.gz"

In [4]:
ratings_url="https://datasets.imdbws.com/title.ratings.tsv.gz"

In [5]:
basics = pd.read_csv(basics_url, sep='\t', low_memory=False)

In [6]:
akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [7]:
ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)

# Data Info

In [8]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [9]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [10]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       264
2  tt0000003            6.5      1810
3  tt0000004            5.6       178
4  tt0000005            6.2      2610

In [11]:
basics = basics.replace({'\\N':np.nan})

In [12]:
# Droping all missing vlaues in 'runtimeMinutes'
basics.dropna(subset=['runtimeMinutes'], inplace=True)
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 1
startYear          169705
endYear           2841482
runtimeMinutes          0
genres              76574
dtype: int64

In [13]:
#Dropping all missing values in 'genres'
basics.dropna(subset=['genres'], inplace=True)
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 0
startYear          164759
endYear           2766495
runtimeMinutes          0
genres                  0
dtype: int64

In [14]:
basics.describe(exclude='number')

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
count,2816170,2816170,2816169,2816169,2816170,2651411,49675,2816170,2816170
unique,2816170,10,1809621,1828449,2,149,91,867,2216
top,tt0000001,tvEpisode,Episode #1.1,Episode #1.1,0,2017,2018,30,Drama
freq,1,1428480,7644,7644,2702850,133981,2391,212926,246611

In [15]:
#Checking vlues for 'titleType'
basics["titleType"].unique()

array(['short', 'movie', 'tvShort', 'tvMovie', 'tvSeries', 'tvEpisode',
       'tvMiniSeries', 'video', 'tvSpecial', 'videoGame'], dtype=object)

In [16]:
#Removing all rows that are not 'movie'
basics.query("titleType == 'movie'", inplace=True)

In [17]:
basics.dropna(subset = ['startYear'], inplace=True)
basics.isna().sum()

tconst                 0
titleType              0
primaryTitle           0
originalTitle          0
isAdult                0
startYear              0
endYear           375245
runtimeMinutes         0
genres                 0
dtype: int64

In [18]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 375245 entries, 8 to 9815469
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          375245 non-null  object
 1   titleType       375245 non-null  object
 2   primaryTitle    375245 non-null  object
 3   originalTitle   375245 non-null  object
 4   isAdult         375245 non-null  object
 5   startYear       375245 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  375245 non-null  object
 8   genres          375245 non-null  object
dtypes: object(9)
memory usage: 28.6+ MB

In [19]:
# Changing the type to 'int' in order to process it
basics['startYear'] = basics['startYear'].astype('int')

# Checking to see if the change took place
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 375245 entries, 8 to 9815469
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          375245 non-null  object
 1   titleType       375245 non-null  object
 2   primaryTitle    375245 non-null  object
 3   originalTitle   375245 non-null  object
 4   isAdult         375245 non-null  object
 5   startYear       375245 non-null  int32
 6   endYear         0 non-null       object
 7   runtimeMinutes  375245 non-null  object
 8   genres          375245 non-null  object
dtypes: int32(1), object(8)
memory usage: 27.2+ MB

In [20]:
# Keeping 'startYear' 2000-2022
basics = basics[(basics['startYear'] >= 2000) & (basics['startYear'] < 2023)]

In [21]:
#Checking for years
basics['startYear'].value_counts()

2017    14366
2018    14320
2019    14056
2016    13951
2015    13477
2014    13100
2022    12747
2013    12381
2021    12328
2012    11628
2020    11559
2011    10776
2010    10202
2009     9352
2008     8150
2007     6962
2006     6514
2005     5829
2004     5203
2003     4587
2002     4131
2001     3863
2000     3640
Name: startYear, dtype: int64

In [22]:
# Exclude movies that are included in the documentary category.
is_documentary = basics['genres'].str.contains('documentary',case=False)
basics = basics[~is_documentary]

In [23]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers = basics['tconst'].isin(akas['titleId'])
keepers

34803      True
61116      True
67669      True
77964      True
86801      True
           ...
9815192    True
9815201    True
9815240    True
9815285    True
9815369    True
Name: tconst, Length: 147388, dtype: bool

In [24]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61116,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
67669,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77964,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86801,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
9815192,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
9815201,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
9815240,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
9815285,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9815369,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama

# Cleaning Akas

In [26]:
# Checking the values of 'region'
akas['region'].value_counts()

DE    4281260
FR    4276958
JP    4275746
IN    4216701
ES    4197194
       ...
JE          2
NU          1
TV          1
PW          1
NR          1
Name: region, Length: 248, dtype: int64

In [27]:
# Keeping only US movies
akas = akas[(akas['region'] == 'US')]
akas['region'].value_counts()

US    1433631
Name: region, dtype: int64

In [28]:
# Replace "\N" with np.nan
akas = akas.replace({'\\N':np.nan})

# Cleaning Ratings

In [29]:
# Replace '\N' with np.nan
ratings.replace({'\\N':np.nan}, inplace=True)

In [30]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers2 =ratings['tconst'].isin(akas['titleId'])
keepers2

0           True
1           True
2          False
3          False
4           True
           ...
1306108    False
1306109    False
1306110    False
1306111    False
1306112    False
Name: tconst, Length: 1306113, dtype: bool

In [31]:
ratings = ratings[keepers2]
ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1966
1        tt0000002            5.8       264
4        tt0000005            6.2      2610
5        tt0000006            5.2       181
6        tt0000007            5.4       816
...            ...            ...       ...
1306074  tt9916200            8.1       229
1306075  tt9916204            8.1       262
1306082  tt9916348            8.3        18
1306083  tt9916362            6.4      5310
1306088  tt9916428            3.8        14

[496938 rows x 3 columns]

# Saving New Data Sets

In [32]:
## Save current dataframe to file.
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [33]:
## Save current dataframe to file.
ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [34]:
## Save current dataframe to file.
akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)